package com.bahar;

//حلقهی forزمانی استفاده میشود که تعداد تکرارها از قبل مشخص است یا میخواهیم شمارش مشخصی را دنبال کنیم.
// for(initialization;condition;update);

//initialization متغیری را که میخواهیم شمارشگر حلقه باشد، مقداردهی اولیه میکنیم.
// :condition شرطی که باید برقرار باشد تا حلقه اجرا شود.
// :update عملی که پس از هر بار اجرای بلوک کد اجرا میشود، مثل افزایش یا کاهش شمارشگر

//در زبان برنامهنویسی جاوا، ساختارهای حلقه به منظور اجرای تکراری دستورات یا بالکهای کد مورد استفاده قرار میگیرند. این
//حلقهها به ما امکان میدهند که دستورات مشخصی را تا زمانی که یک شرط برقرار است، اجرا کنیم. در جاوا، چندین نوع حلقه
//وجود دارد که هر کدام ساختار و کاربرد مخصوص به خود را دارند.


// adade 1 ta 10 ro mikhaym ba for chap konim
//adade 1 ta 1000 ro chap kon(seyre nozooli)
public class ForLoop_General
{
    public static void main( String[] args )
    {
        for(int i=1; i<=10; i++){
            System.out.println(i);
        }

   //________________________________________________________________________________

        for(int j=1; j>=-1000; j--){
            System.out.println(j);
        }

    }
}
